ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l211x_l112x/UC6_I2CC_1.0.xml
    <register id="UC6_I2CC_IFLS" width="32" offset="0x110C" description="Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_NOT_FULL" value="0x4" description="Opposite of full"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x6" description="TX FIFO &lt;= 1"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x7" description="TX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_NOT_EMPTY" value="0x4" description="Opposite of empty"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x6" description="RX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x7" description="RX_FIFO &lt;= 1"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_TPR" width="32" offset="0x1110" description="Timer Period">
        <bitfield id="TPR" description="Timer Period 
This field is used in the equation to configure SCL_PERIOD :
SCL_PERIOD = (1 + TPR ) * (SCL_LP + SCL_HP ) * INT_CLK_PRD
where: 
  SCL_PRD is the SCL line period (I2C clock).
  TPR is the Timer Period register value (range of 1 to 127).
  SCL_LP is the SCL Low period (fixed at 6).
  SCL_HP is the SCL High period (fixed at 4).
  CLK_PRD is the functional clock period in ns." begin="6" end="0" width="7" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x7F" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_GFCTL" width="32" offset="0x1118" description="I2C Glitch Filter Control">
        <bitfield id="AGFEN" description="Analog Glitch Suppression Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Analog Glitch Filter disable"/>
            <bitenum id="ENABLE" value="0x1" description="Analog Glitch Filter enable"/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_BMON" width="32" offset="0x111C" description="Bus Monitor">
        <bitfield id="SCL" description="I2C SCL Status" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The I2CSCL signal is low."/>
            <bitenum id="SET" value="0x1" description="The I2CSCL signal is high. Note: During and right after reset, the SCL pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
        </bitfield>
        <bitfield id="SDA" description="I2C SDA Status" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The I2CSDA signal is low."/>
            <bitenum id="SET" value="0x1" description="The I2CSDA signal is high. Note: During and right after reset, the SDA pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_TXDATA" width="32" offset="0x1120" description="TXData">
        <bitfield id="DATA" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_RXDATA" width="32" offset="0x1124" description="RXData">
        <bitfield id="DATA" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_PECSR" width="32" offset="0x1128" description="PEC status register">
        <bitfield id="PECBYTECNT" description="PEC Byte Count	
This is the current PEC Byte Count of the Controller State Machine." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="PECSTS_CHECK" description="This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC was not checked in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates if the PEC was checked in the transaction that occurred before the last Stop"/>
        </bitfield>
        <bitfield id="PECSTS_ERROR" description="This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC check error did not occurr in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates if a PEC check error occurred in the transaction that occurred before the last Stop"/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_TA" width="32" offset="0x114C" description="Target Address Register">
        <bitfield id="DIR" description="Receive/Send
The DIR bit specifies if the next operation is a Receive (High) or Transmit (Low).
0h = Transmit
1h = Receive" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRANSMIT" value="0x0" description="in transmit mode."/>
            <bitenum id="RECEIVE" value="0x1" description="is in receive mode."/>
        </bitfield>
        <bitfield id="ADDR" description="I2C Target Address This field specifies bits A9 through A0 of the Target address.
In 7-bit addressing mode as selected by MSA.MODE bit, the top 3 bits are don't care" begin="10" end="1" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODE" description="This bit selects the adressing mode to be used 
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="MODE7" value="0x0" description="7-bit addressing mode"/>
            <bitenum id="MODE10" value="0x1" description="10-bit addressing mode"/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_TIMEOUT_CNT" width="32" offset="0x1150" description="I2C Timeout Count Register">
        <bitfield id="TCNTA" description="Timeout Count A Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter A" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTB" description="Timeout Count B Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter B" begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_TIMEOUT_CTL" width="32" offset="0x1154" description="I2C Timeout Count Control Register">
        <bitfield id="TCNTLA" description="Timeout counter A load value
Counter A is used for SCL low detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout A count. NOTE: The value of CNTLA must be greater than 1h. 
Each count is equal to 520 times the timeout period of functional clock. For example, with 8MHz functional clock and a 100KHz operating I2C clock, one timeout period will be equal to (1 / 8MHz) * 520 or 65 us." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTAEN" description="Timeout Counter A Enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
        <bitfield id="TCNTLB" description="Timeout Count B Load: Counter B is used for SCL High Detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout B count. NOTE: The value of CNTLB must be greater than 1h. 
Each count is equal to 1* clock period. For example, with 10MHz functional clock one timeout period will be equal to1*100ns." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTBEN" description="Timeout Counter B Enable" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
    </register>
    <register id="UC6_I2CC_PECCTL" width="32" offset="0x1158" description="I2C PEC control register">
        <bitfield id="PECCNT" description="PEC Count
When this field is non zero, the number of I2C bytes are counted (Note that although the PEC is calculated on the I2C address it is not counted at a byte). When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.
In the normal Controller use case, FW would set PECEN=1 and PECCNT=SMB packet length (Not including Target Address byte, but including the PEC byte). FW would then configure DMA to allow the packet to complete unassisted and write MCTR to initiate the transaction.
Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction.
Note that any write to the I2PECCTL Register will clear the current PEC Byte Count in the State Machine." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="PECEN" description="PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits except the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="PEC is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="PEC is enabled"/>
        </bitfield>
    </register>

</module>